{
    "saveLocation": "Set the directory where media files are saved.",
    "outputFilename": "Change the format of the output filename. You can find the full list of fields at [yt-dlp's README](https://github.com/yt-dlp/yt-dlp#output-template)",
    "downloadInWebsiteFolders": "When enabled, ezytdl will download media files in a folder named after the website it was downloaded from.",
    "downloadFromClipboard": "When enabled, ezytdl will automatically prompt you to download media from your clipboard when it detects a valid URL.",
    "checkForUpdates": "Each setting here controls what parts of ezytdl will have updates checked for. If you want to disable all auto update checking, disable all of these settings.",
    "updateCheckDaysInterval": "Set the amount of days between each update check. This is useful if you want to reduce the amount of times ezytdl checks for updates.",
    "reduceAnimations": "Remove some animations that may perform poorly on some systems.",
    "disableAnimations": "Disables all of the animations in the app (in a crude manner). This will not disable smaller things like progress bars, but is still useful if you want to reduce the amount of resources ezytdl uses, though reducing the animations should have a similar effect.",
    "lastMediaConversionOutputs": "Set the format ezytdl should convert media files to.",
    "lastMediaConversionOutputsExtended": {
        "audio": "The audio format to convert to.",
        "video": "The video format to convert to."
    },
    "concurrentDownloads": "Set the maximum amount of yt-dlp downloads & FFmpeg conversions should be running at a time.",
    "hardwareAcceleratedConversion": "Allow ezytdl to use your system's hardware to convert videos. This is useful if you want to speed up the conversion process.",
    "onlyGPUConversion": "Prevent ezytdl from converting a video if it cannot be accelerated by any of your system's hardware. This is useful if you want to prevent ezytdl from using your CPU to convert videos.",
    "ffmpegPresets": "Show / hide FFmpeg presets. This is useful if you want to reduce the amount of options ezytdl has.",
    "closeToTray": "Allow ezytdl to close to the system tray instead of exiting when the window is closed.",
    "logsEnabled": "Allows ezytdl to log information to the console. This is useful for debugging and/or bug reporting.",
    "defaultWindowControls": "If this is enabled, ezytdl will use your operating system's default window border & controls. This will only be applied on the next launch of ezytdl.",
    "nightlyUpdates": "When enabled, ezytdl will install nightly updates when available. This is useful if you want to test new features before they are released -- but beware, these updates may be unstable!",
    "advanced": "When enabled, ezytdl will show more options when using the app. This is useful if you want to input direct command line arguments."
}